#Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:

#Попросіть користувача ввести свсвій вік (можно використати константу або input()).

#- якщо користувачу менше 6 - вивести повідомлення "Де твої батьки?"

#- якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"

#- якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"

#- якщо вік користувача містить цифру 7 - вивести повідомлення "Вам пощастить!"

#- у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"

#P.S. На екран має бути виведено лише одне повідомлення, якщо вік користувача містить цифру тільки відповідне повідомлення! Також подумайте над варіантами, коли введені невірні або неадекватні (неможливі) дані.    
max_attempts = 3
attempts = 0

while True:
    user_input = input('Enter your real age: ')
    if user_input.isdigit():
        user_input = int(user_input)
        if 3 <= user_input <= 122:
            break
    else:
        print('Wrong! Enter the NUMBER!')
        attempts += 1
        remaining_attempts = max_attempts - attempts
        print(f"Remaining attempts: {remaining_attempts}")
    if attempts == max_attempts:
        print("Exceeded maximum attempts")
        exit()
if user_input < 6:
    print("Де твої батьки?")
elif 6 <= user_input < 16:
    if '7' in str(user_input):
        print("Вам щастить!")
    else: print("Це фільм для дорослих!")
elif user_input > 65:
    if '7' in str(user_input):
        print("Вам щастить!")
    else: print("Покажіть пенсійне посвідчення!")
else:
    if '7' in str(user_input):
        print("Вам щастить!")
    else: print("А білетів вже немає!")

#P.P.S. (Опційно дайте відповідь на питання)

#Що ви бачите як результат цього курсу
#Отримати міцні базові навички з Piton
#Як ви збираєтесь використовувати цей результат
#Розвиватися в подальшому працювати в цій сфері 
#Чим ви готорі пожертвувати заради результату
#Час,сили,грощі 